# Options Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentSynchronizingWithCentralEventArgs..::..Options Property
DocumentSynchronizingWithCentralEventArgs Class See Also
---
User's options associated with the synchronization operation.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public SynchronizeWithCentralOptions Options { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Options As SynchronizeWithCentralOptions
	Get
```

Visual C++
---
```text
public:
property SynchronizeWithCentralOptions^ Options {
	SynchronizeWithCentralOptions^ get ();
}
```

# See Also
DocumentSynchronizingWithCentralEventArgs Class
Autodesk.Revit.DB.Events Namespace